Revit 2024 API
FabricationPart.Slope Property
 The slope for the straight fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double Slope { get; }
Visual Basic
Public ReadOnly Property Slope As Double
	Get
Visual C++
public:
property double Slope {
	double get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace